In [1]:
import pandas as pd
import numpy as np

# Sort DataFrame based on another list

In [9]:
df = pd.DataFrame([["A", 1], ["B", 2], ["C", 3], ["D", 4]],
                  columns = ["Col_A", "Col_B"])

sort_list = ["C", "D", "B", "A"]
df

  Col_A  Col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [5]:
s = pd.Series(range(len(sort_list)),index = sort_list)
output_df = df.sort_values('Col_A',key=lambda x: x.map(s))
output_df

  Col_A  Col_B
2     C      3
3     D      4
1     B      2
0     A      1

# Insert a column at a specific location in a DataFrame

In [14]:
df = pd.DataFrame([["A", 1], ["B", 2], ["C", 3], ["D", 4]],
                  columns = ["Col_A", "Col_B"])

new_column = ["P", "Q", "R", "S"]
insert_position = 1

In [15]:
df.insert(insert_position, "col_C", new_column)
df

  Col_A col_C  Col_B
0     A     P      1
1     B     Q      2
2     C     R      3
3     D     S      4

# Select columns based on the columnâ€™s Data Type

In [16]:
df = pd.DataFrame([["A", 1, True], ["B", 2, False],
                   ["C", 3, False], ["D", 4, True]], 
                  columns=["col_A", "col_B", "col_C"])

dt_type = "bool"

In [18]:
output_df = df.select_dtypes(dt_type)
output_df

   col_C
0   True
1  False
2  False
3   True

# Count the number of Non-NaN cells for each column

In [19]:
df = pd.DataFrame([["A", np.NaN], [np.NaN, 2],
                   ["C", np.NaN], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A    NaN
1   NaN    2.0
2     C    NaN
3     D    4.0

In [20]:
df.count()

col_A    3
col_B    2
dtype: int64

# Split DataFrame into equal parts

In [21]:
df = pd.DataFrame([["A", 1], ["B", 2], ["C", 3], ["D", 4],["E", 5],["F", 6]], 
                  columns=["col_A", "col_B"])
parts = 2

In [22]:
out_df1, out_df2 = np.split(df, parts)
out_df1 , out_df2

(  col_A  col_B
 0     A      1
 1     B      2
 2     C      3,
   col_A  col_B
 3     D      4
 4     E      5
 5     F      6)

# Reverse DataFrame row-wise or column-wise

In [23]:
df = pd.DataFrame([["A", 1], ["B", 2], ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [24]:
col_reverse = df.loc[:,::-1]
col_reverse

   col_B col_A
0      1     A
1      2     B
2      3     C
3      4     D

In [25]:
row_reverse = df.loc[::-1]
row_reverse

  col_A  col_B
3     D      4
2     C      3
1     B      2
0     A      1

# Rearrange columns of a DataFrame

In [26]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

rearrange_order = [1,0]
df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [27]:
output_df = df.iloc[:, rearrange_order]
output_df

   col_B col_A
0      1     A
1      2     B
2      3     C
3      4     D

In [28]:
# Try it more example:
df = pd.DataFrame([["A", 1,False], ["B", 2,True],
                   ["C", 3,True], ["D", 4,False]], 
                  columns=["col_A", "col_B","col_C"])

rearrange_order = [2,0,1]
output_df = df.iloc[:, rearrange_order]
output_df

   col_C col_A  col_B
0  False     A      1
1   True     B      2
2   True     C      3
3  False     D      4

# Insert a row at an arbitrary position

In [31]:
df = pd.DataFrame([["A", 1], ["B", 2], ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

insert_pos = 1
insert_row = ["P", 5]
df.loc[insert_pos - 0.1] = insert_row
df = df.sort_index()
df = df.reset_index(drop = True)
df

  col_A  col_B
0     A      1
1     P      5
2     B      2
3     C      3
4     D      4

# Apply function to every cell of DataFrame

In [34]:
df = pd.DataFrame([[1, 5], [2, 6], [3, 7], [4, 8]], 
                  columns=["col_A", "col_B"])

def func(num):
    return num + 1

df = df.applymap(func)
df

   col_A  col_B
0      2      6
1      3      7
2      4      8
3      5      9